# -*- coding: utf-8 -*-

#
# This is only an example. Don't use it.
#
from __future__ import unicode_literals

fixes['spell'] = {
	'regex': True,
	'msg': {
		'_default': 'Διόρθωση ορθογραφικών test',
	},
	'replacements': [
		(r' (έιναι|ειναι) ', r' είναι '),
		(r' εχ(ω|εις|ει|ουμε|ετε|ουν) ', r' έχ\1 '),
		(r' ειχ(α|ες|ε|αμε|ατε|αν|ανε) ', r' είχ\1 '),
		(r' οποι(ο|ου|ων|α|ας|ες) ', r' οποί\1 '),
		(r' αλλ(ος|ου|ο|η|ης|ες|οι|ων|ους) ', r' άλλ\1 '),#όχι αλλα
		(r' πέρν(ω|εις|ει|ουμε|ετε|ουν) ', r' παίρν\1 '),
		(r' κατανομάζ(ω|εις|ει|ουμε|ετε|ουν|ουνε) ', r' κατονομάζ\1 '),
		#(r' (καὶ|καί) ', r' και '),
		#(r' έκφρασα ', r' εξέφρασα '),
		(r' ηταν(ε) ', r' ήταν\1 '),
		(r' (σελ|πβ|εκδ|σσ|γενν|βλ|αγγλ|γερμ|δηλ|πληθ|ουσ|εφημ|κεφ|αρχ|εκατ) ', r' \1. '),#Βάζουμε τελεία
		(r' (π|μ)Χ ', r' \1.Χ. '),#τελεία στο π.X. μ.Χ.
		(r' (π|μ)μ ', r' \1.μ. '),
		(r' λχ ', r' λ.χ. '),
		(r' ποιός ', r' ποιος '),
		(r' ποιά ', r' ποια '),
		(r' ποιό ', r' ποιο '),
		(r' πχ ', r' π.χ. '),
		(r' ανα ', r' ανά '),
		(r' οχι ', r' όχι '),
		(r' υπο ', r' υπό '),
		(r' παιρνώ ', r' περνώ '),
		(r' τοτε ', r' τότε '),
		#(r' μιά ', r' μία '),
		#(r' γιαυτό ', r' γι\' αυτό '),
		(r' θυληκό ', r' θηλυκό '),
		(r' ουτε ', r' ούτε '),
		(r' ακομη ', r' ακόμη '),
		(r' τοσο ', r' τόσο '),
		(r' ο,τιδήποτε ', r' οτιδήποτε '),
		(r' τίθονται ', r' τίθενται '),
		#(r' δια ', r' διά '),
		(r' αντι ', r' αντί '),
		(r' οταν ', r' όταν '),
		(r' λογω ', r' λόγω '),
		(r' χόρος ', r' χώρος '),
		(r' χωρός ', r' χορός '),
		(r' διοτι ', r' διότι '),
		(r' ομως ', r' όμως '),
		(r' ωστε ', r' ώστε '),
		(r' εαν ', r' εάν '),
		(r' ηδη ', r' ήδη '),
		(r' ενώ ', r' ενώ '),
		(r' επειδη ', r' επειδή '),
		(r' οτι ', r' ότι '),
		(r' ο,τι ', r' ό,τι '),
		(r' απο ', r' από '),
		(r' γιατι ', r' γιατί '),
		(r' οπου ', r' όπου '),
		(r' μεσα ', r' μέσα '),
		(r' κατα ', r' κατά '),
		#(r' ό ', r' ο '),
		(r' μετα ', r' μετά '),
		(r' (εώς|εως) ', r' έως '),
		(r' παρα ', r' παρά '),
		(r' καμμία ', r' καμία '),
		(r' καμια ', r' καμιά '),
		(r' επισης ', r' επίσης '),
		(r' ολο ', r' όλο '),
		(r' εν(α|ας) ', r' έν\1 '),
	],
	'exceptions': {
            'inside-tags': [
                'nowiki',
                'template',
                'comment',
                'math',
                'pre',           # because of code examples
                'source',        # because of code examples
                'startspace',    # because of code examples
                'hyperlink',     # e.g. commas in URLs
                'link',
                'gallery',       # because of filenames
                'timeline',
            ],
            'inside': [
                r'<code>.*</code>',  # because of code examples
             ]
        }
}

